Repository: adslbarxatov/UniNotifier
Catalog: src/android/UniNotifier_*.resx
Languages: ru_ru

# ActionIsUnsupported
source: Action is unsupported for this type of notifications
ru_ru: Действие не поддерживается для этого типа оповещений

# AddAsNewMessage
source: Added new notification:
ru_ru: Добавлено новое оповещение:

# AlarmSettingsLabel
source: Allow:
ru_ru: Разрешить:

# AllNewsRequest
source: This option will sequentially poll all notifications. It may take some time. Continue?
ru_ru: Эта опция последовательно опросит все оповещения. Это может занять какое-то время. Продолжить?

# AllowLightLabel
source: Light indication
ru_ru: Световая индикация

# AllowSoundLabel
source: Sound alerts
ru_ru: Звуковые оповещения

# AllowStartLabel
source: Keep service active after exit
ru_ru: Оставить службу активной после выхода

# AllowVibroLabel
source: Vibration
ru_ru: Вибрация

# ApplyMessage
source: Notification updated:
ru_ru: Обновлено оповещение:

# BackgroundRequestInProgress
source: Please wait for the remaining notifications to respond...
ru_ru: Пожалуйста, дождитесь ответа всех оповещений...

# BackgroundRequestOn
source: Background request step: <b>{0:D}</b> minutes
ru_ru: Шаг фонового опроса, минут: {0:D}

# CommunitySelect
source: Select community:
ru_ru: Выберите сообщество:

# ComparatorLabel
source: Check the first number in text and make urgent alert when value is
ru_ru: Сравнивать первое число в тексте и показывать предупреждение, если оно

# ComparatorLabelOff
source: Threshold
ru_ru: Порог

# ComparatorTypes
source: > (greater than) ≥ (greater than or equal to) < (less than) ≤ (less than or equal to) = (equal to) ≠ (not equal to) ∈ (contains)
ru_ru: > (больше, чем) ≥ (больше либо равно) < (меньше, чем) ≤ (меньше либо равно) = (равно) ≠ (не равно)

# CurlyTemplate
source: Remember to replace items enclosed in curly braces with values you want. For example: {CITY} to Reykjavik, {CURRENCY} to ZWL
ru_ru: Не забудьте заменить элементы, заключённые в фигурные скобки (включая фрагменты ссылки на веб-страницу), на то, что Вам нужно

# DeleteMessage
source: Remove the selected notification?
ru_ru: Удалить выбранное оповещение?

# DisableOption
source: Disable the notification
ru_ru: Отключить уведомление

# EnabledLabel
source: Active
ru_ru: Активно

# FindDisclaimer
source: For using this function specify some keyword from needed website’s area in the “Beginning” field
ru_ru: Для использования этой функции укажите какое-либо ключевое слово из целевого участка сайта в поле «Начало»

# FontSizeLabel
source: Font size of the main log: <b>{0:D}</b>
ru_ru: Размер шрифта:

# GoToOption
source: Go to the source
ru_ru: Перейти на веб-страницу

# IgnoreMisfitsLabel
source: Don’t show inconsistent texts
ru_ru: Не показывать несоответствующие тексты

# LaunchMessage
source: Notification service is in standby mode. Click on this message to go to the main log
ru_ru: Служба оповещений находится в режиме ожидания. Нажмите на это сообщение, чтобы перейти к журналу

# LinkFieldLabel
source: Link and markup:
ru_ru: Ссылка:

# LogPage
source: Log
ru_ru: Журнал оповещений

# LogSettingsLabel
source: Main log
ru_ru: Настройки журнала:

# MainLogPlaceholder
source: (no notifications yet)
ru_ru: (уведомлений пока нет)

# NameFieldLabel
source: Name:
ru_ru: Название:

# NameFieldPlaceholder
source: (name)
ru_ru: (название)

# NewItemsMessage
source: New records: {0:D}. Click this message to watch them
ru_ru: Новых оповещений: {0:D}. Нажмите это сообщение, чтобы прочитать их

# NewItemsUrgentMessage
source: WARNING! URGENT NOTIFICATIONS RECEIVED!
ru_ru: ВНИМАНИЕ! ЕСТЬ СРОЧНЫЕ ОПОВЕЩЕНИЯ!

# NoTemplateInClipboard
source: No compatible notification templates found in the clipboard. Copy template string to clipboard and try again
ru_ru: В буфере обмена не найдено совместимых шаблонов уведомлений. Скопируйте строку шаблона в буфер и повторите попытку

# NotEnoughDataMessage
source: One of required fields is empty, or link to website is specified incorrectly
ru_ru: Одно из обязательных полей не заполнено, или ссылка на ресурс указана некорректно

# NotificationButton
source: Go to
ru_ru: Перейти

# NotificationsSettingsLabel
source: Notifications parameters:
ru_ru: Параметры оповещений:

# NotificationsWizard
source: Using wizard
ru_ru: С помощью мастера

# NotMatchingNames
source: Notification with the same name already added
ru_ru: Оповещение с таким именем уже добавлено

# NotSettingsPage
source: Notifications settings
ru_ru: Настройки оповещений

# NotWizardButton
source: Notifications wizard
ru_ru: Мастер оповещений

# NotWizardLabel
source: New notifications
ru_ru: Создание новых оповещений:

# OccFieldLabel
source: Occurrence <b>#{0:D}</b>
ru_ru: Вхождение №{0:D}

# OtherOption
source: More...
ru_ru: Ещё...

# ReadModeLabel
source: Night theme for the main log
ru_ru: Режим чтения

# RemoveOption
source: Remove from log
ru_ru: Удалить из журнала

# RequestAgainOption
source: Request again
ru_ru: Опросить ещё раз

# RequestAllStarted
source: Polling all notifications...
ru_ru: Запрос всех новостей...

# RequestCompleted
source: All available changes received
ru_ru: Получены все доступные новости

# RequestStarted
source: Requesting item...
ru_ru: Запрос новости...

# SearchFailure
source: Link to webpage is incorrect or keyword is not found on this page
ru_ru: Неверно задана ссылка на веб-страницу, или ключевое слово на странице не обнаруживается

# SelectComparatorType
source: Select comparison type:
ru_ru: Выберите способ сравнения:

source: Select language:
ru_ru: Выберите язык:

source: Select notification:
ru_ru: Выберите оповещение:

source: Select option:
ru_ru: Выберите действие:

source: Select template:
ru_ru: Выберите шаблон:

# ServiceSettingsLabel
source: Background service
ru_ru: Фоновая служба:

# SettingsPage
source: Application settings
ru_ru: Настройки приложения

# ShareOption
source: Share text
ru_ru: Поделиться текстом

# TemplateClipboard
source: From clipboard
ru_ru: Из буфера обмена

# TemplateList
source: From template
ru_ru: Из шаблона

# TemplateSelect
source: Create new notification:
ru_ru: Создание нового оповещения:

# Tip01
source: Welcome to uNot, the web resources supervisor service! • On this page you can configure existing notifications. • Swipe this screen to the right to set up parameters of the service and add new web resources to watch
ru_ru: Добро пожаловать в UniNotifier! • На этой странице Вы можете настроить уведомления. • Смахните экран вправо, чтобы задать параметры службы новостей

# Tip02
source: • Detailed instructions for setting up the service are available on YouTube. Swipe this screen to the left and select the user guide for watching it. • The main notifications log is available on the first page of the application. It will be opened on every further start of the app
ru_ru: • Подробная инструкция по настройке службы доступна на YouTube. Смахните этот экран влево и выберите руководство пользователя. • Главный журнал уведомлений доступен на первой странице приложения. Он будет открываться при каждом следующем вызове UniNotifier

# Tip03_1
source: Warning! Some devices are requiring manual unlocking of internet access (f.e., in case of internet traffic saving mode) for the app. Check it if you will not get notifications
ru_ru: Внимание! Некоторые устройства требуют ручного разрешения на доступ в интернет (например, если активен режим экономии интернет-трафика). Проверьте его, если уведомления не будут работать

# Tip03_2
source: Also, your device requires manual permission for sounds, lights and vibration for notifications. Select them in the system settings if necessary (when the background service is enabled – otherwise settings will be unavailable). The application creates two notification channels: • for urgent and mixed (which require sound or vibration indication); • for non-urgent (which can be left without indication). The channeling is determined by the “Urgent notifications only” and “Threshold” settings
ru_ru: . Также ваше устройство требует ручного разрешения звуков, света и вибрации для уведомлений. При необходимости выберите их в настройках системы

# Tip04_1
source: This button allows you to apply changes performed below to the currently selected notification
ru_ru: Эта кнопка позволяет применить изменения, выполненные ниже, к текущему выбранному уведомлению

# Tip04_10
source: This option allows you to open the source of the selected notification in browser
ru_ru: Эта опция позволяет открыть источник выбранного уведомления в браузере

# Tip04_11
source: This button allows you to select notification for configuring
ru_ru: Эта кнопка позволяет выбрать уведомление для настройки

# Tip04_13
source: If this switch is enabled, the background service will remain active when the app is closed or minimized. This allows you to quickly call the app when necessary (via a pinned notification) and see the quantity of unread records in the main log
ru_ru: Если этот флажок включён, фоновая служба останется активной, когда приложение будет закрыто или свёрнуто. Это позволяет быстрее вызывать приложение при необходимости (через закреплённое оповещение), а также видеть число непрочитанных новостей

# Tip04_15
source: In some cases, the needed part of webpage is not the first on it, which is limited by the specified markers. This field allows you to specify which occurrence of the target area (from the top of the page) should be displayed
ru_ru: В некоторых случаях нужный участок веб-страницы оказывается на ней не первым, который ограничен заданными маркерами. Это поле позволяет указать, какое именно вхождение целевого участка (от начала страницы) следует отображать

# Tip04_18
source: All operations with texts of notifications are available through the clicking on them in the main log
ru_ru: Все операции с текстами уведомлений теперь доступны по клику на них прямо в главном журнале

# Tip04_2
source: This button allows you to share settings of notifications
ru_ru: Эта кнопка позволяет поделиться настройками текущего уведомления

# Tip04_20
source: This function allows you to set a numerical threshold. It will be compared with the first number in every obtained text using the specified comparison method. If the new text matches the condition, app will display a special warning. It is also possible to display the notification only if this condition is met
ru_ru: Эта функция позволяет установить числовой порог. Он будет сравниваться с первым числом в каждом полученном тексте с использованием указанного метода сравнения. Если новый текст соответствует условию, приложение отобразит специальное предупреждение. Также возможно отображение уведомления только при соблюдении этого условия

# Tip04_3
source: This button allows you to add new notification with settings presented above
ru_ru: Эта кнопка позволяет добавить новое уведомление с настройками, представленными выше

# Tip04_4
source: This button allows you to remove selected notification
ru_ru: Эта кнопка позволяет удалить выбранное уведомление

# Tip04_7
source: This option allows you to share the text of selected notification. Please note that app adds links to information sources to notifications you share (in order to respect the rights of authors). It is recommended not to remove them when distributing texts using this function
ru_ru: Эти опция позволяет поделиться текстом уведомления. Обратите внимание, что приложение добавляет к оповещениям, которыми Вы делитесь, ссылки на источники информации (в целях соблюдения прав авторов). Рекомендуется не удалять их при распространении текстов с помощью этой функции

# TipHeader01
source: Tip
ru_ru: Подсказка

# UpdateTemplates
source: Update notification templates
ru_ru: Обновить шаблоны оповещений

# UpdatingTemplates
source: Updating of notification templates...
ru_ru: Обновление шаблонов оповещений...

# UpdatingTemplatesCompleted
source: Updating of templates completed...
ru_ru: Обновление шаблонов завершено

# WizardFailure
source: Unable to determine suitable markup. Refine the site URL or try a different keyword
ru_ru: Похоже, этот сайт не поддерживается в UniNotifier. Попробуйте использовать другое ключевое слово

# WizardSearch1
source: Detecting markers...
ru_ru: Определяем маркеры...

# WizardSearch2
source: Requesting text...
ru_ru: Запрашиваем текст...

# WizardStep1
source: Welcome to the notifications wizard! This function will help you to create a notification (“watchdog”) for web resource. First, enter the link (URL) of the website you want to watch
ru_ru: Вас приветствует мастер создания оповещений! Эта функция поможет сформировать оповещение, которое сможет автоматически опрашивать UniNotifier. Для начала введите ссылку (URL) на сайт, с которого Вы хотите получать оповещения

# WizardStep2
source: Now enter a keyword. This word (or phrase) should be present right now in a part of the website you want to watch, and you expect it to change over time. The ideal would be a phrase that is present now only in this area or is first encountered on the website in it. The case of letters doesn’t matter
ru_ru: Теперь укажите ключевое слово. Это слово (или фраза) должно присутствовать прямо сейчас в той части сайта, которая будет меняться со временем, что и будет источником текстов для оповещений. Идеальной будет фраза, присутствующая сейчас только в этой области либо впервые встречается на сайте именно в ней. Регистр букв значения не имеет

# WizardStep3
source: For the specified settings, the text below is received. If it meets your expectations, click “Next” to add the notification. Otherwise, click “Retry” and we’ll try again
ru_ru: По указанным настройкам получен текст, приведённый ниже. Если он соответствует Вашим ожиданиям, нажмите ОК для добавления оповещения. В противном случае нажмите Повторить, и мы попробуем ещё раз

# WizardStep4
source: For the specified settings, the text below is received. If it meets your expectations, click “Next” to add the notification. Otherwise, cancel the action and try a different keyword
ru_ru: По указанным настройкам получен текст, приведённый ниже. Если он соответствует Вашим ожиданиям, нажмите ОК для добавления оповещения. В противном случае отмените действие и попробуйте другое ключевое слово

# WizardStep5
source: It’s ready! Now specify the name of notification to be displayed in the main log
ru_ru: Готово! Осталось указать название оповещения для отображения в журнале
