Repository: adslbarxatov/UniNotifier
Catalog: src/UniNotifier_*.resx
Languages: ru_ru

# CurlyTemplate
source: Remember to replace items enclosed in curly braces with what you want
ru_ru: Не забудьте заменить элементы, заключённые в фигурные скобки, на то, что Вам нужно

# DeleteMessage
source: Delete the selected notification?
ru_ru: Удалить выбранное оповещение?

# KeywordNotSpecified
source: Search keyword is missing in “Beginning” field
ru_ru: В поле «Начало» не указано ключевое слово для поиска

# MainMenuOption02
source: &Notifications settings
ru_ru: &Настройки оповещений

# NotEnoughDataMessage
source: One of required fields is empty, or link to website is specified incorrectly
ru_ru: Одно из обязательных полей не заполнено, или ссылка на ресурс указана некорректно

# NotMatchingNames
source: Notification with the same name already exists. The name has been adjusted
ru_ru: Оповещение с таким именем уже существует. Название было скорректировано

# SearchFailure
source: Link to a webpage is incorrect or keyword is not found on this page
ru_ru: Неверно задана ссылка на веб-страницу, или ключевое слово на странице не обнаруживается

# UNNotSettingsForm_NameLabel
source: Name:
ru_ru: Название:

# UNNotSettingsForm_LinkLabel
source: URL:
ru_ru: Ссылка:

# UNNotSettingsForm_BeginningLabel
source: Beginning:
ru_ru: Начало:

# UNNotSettingsForm_EndingLabel
source: Ending:
ru_ru: Конец:

# UNNotSettingsForm_FrequencyLabel
source: Update frequency, minutes:
ru_ru: Частота обновления, минут:

# UpdateLineNotSpecified
source: Notification for updating is not selected
ru_ru: Не выбрано оповещение для обновления

# UpdateMessage
source: Update selected notification?
ru_ru: Обновить выбранное оповещение?

# UNNotSettingsForm_OccurrenceLabel
source: Occurrence number:
ru_ru: Номер вхождения:

# Tip_0001
source: Welcome to UniNotifier, the web resources supervisor service! Here you can configure the service and notifications. Some buttons and fields contain useful tips that will be shown once. Detailed instructions for setting up the service are available on YouTube (“User guide” button in the app info window)
ru_ru: Добро пожаловать в UniNotifier – службу наблюдения за состоянием веб-ресурсов! Здесь вы можете настроить службу и сами уведомления. Некоторые кнопки и поля содержат полезные подсказки, которые будут показаны однократно. Подробные инструкции по настройке сервиса доступны на YouTube (кнопка «Руководство» в окне сведений о приложении)

# Tip_0010
source: This button allows you to load settings from notification template
ru_ru: Эта кнопка позволяет загрузить настройки из шаблона уведомления

# Tip_0020
source: This button allows you to automatically find delimiters for the new notification (see user manual for details)
ru_ru: Эта кнопка позволяет автоматически находить разделители для нового уведомления (подробности см. в руководстве пользователя)

# Tip_0040
source: This section allows you to select the notification, the source of which will be opened in browser
ru_ru: В этом разделе можно выбрать уведомление, источник которого будет открыт в браузере

# Tip_0080
source: This field allows you to select notification for configuring
ru_ru: В этом поле можно выбрать уведомление для настройки

# Tip_0100
source: When you'll close this window, the background service will start and begin monitoring. When you call settings interface again, the service will be paused for its correct configuration
ru_ru: Когда вы закроете это окно, запустится фоновая служба, и начнётся мониторинг. При повторном вызове интерфейса настроек служба будет приостановлена для правильной настройки

# Tip_0200
source: In some cases, the needed part of web page is not the first on it, which is limited by the specified markers. This field allows you to specify which occurrence of the target area (from the top of page) should be displayed
ru_ru: В некоторых случаях нужная часть веб-страницы оказывается на ней не первой среди ограниченный указанными маркерами. Это поле позволяет указать, какое вхождение целевой области (сверху страницы) должно отображаться

# NoTemplateInClipboard
source: No compatible notification templates found in the clipboard. Copy template string to clipboard and try again
ru_ru: В буфере обмена не найдено совместимых шаблонов уведомлений. Скопируйте строку шаблона в буфер обмена и попробуйте ещё раз

# Tip_0400
source: This button allows you to share settings of configured notifications
ru_ru: Эта кнопка позволяет поделиться настройками уведомлений

# Tip_0800
source: This button allows you to load shared or saved settings
ru_ru: Эта кнопка позволяет загружать настройки уведомлений

# WizardFailure
source: It looks like this site is not supported. Try using a different keyword
ru_ru: Похоже, этот сайт не поддерживается. Попробуйте использовать другое ключевое слово

# WizardSearch1
source: Detecting markers...
ru_ru: Определяем маркеры...

# WizardSearch2
source: Requesting text...
ru_ru: Запрашиваем текст...

# WizardStep1
source: Welcome to the notifications wizard! This function will help you to create a notification (“watchdog”) for web resource. First, enter the link (URL) of the website you want to watch
ru_ru: Вас приветствует мастер создания оповещений! Эта функция поможет сформировать оповещение (наблюдатель) для веб-ресурса. Для начала введите ссылку (URL) на сайт, за которым Вы хотите наблюдать

# WizardStep2
source: Now enter a keyword. This word (or phrase) should be present right now in a part of the website you want to watch, and you expect it to change over time. The ideal would be a phrase that is present now only in this area or is first encountered on the website in it. The case of letters doesn’t matter
ru_ru: Теперь укажите ключевое слово. Это слово (или фраза) должно присутствовать прямо сейчас в той части сайта, за которой Вы хотите наблюдать и от которой ожидаете изменений с течением времени. Идеальной будет фраза, присутствующая сейчас только в этой области либо впервые встречается на сайте именно в ней. Регистр букв значения не имеет

# WizardStep3
source: For the specified settings, the text below is received. If it meets your expectations, click OK to add the notification. Otherwise, click Retry and we’ll try again
ru_ru: По указанным настройкам получен текст, приведённый ниже. Если он соответствует Вашим ожиданиям, нажмите ОК для добавления оповещения. В противном случае нажмите Повторить, и мы попробуем ещё раз

# WizardStep4
source: For the specified settings, the text below is received. If it meets your expectations, click OK to add the notification. Otherwise, retry the action and try a different keyword
ru_ru: По указанным настройкам получен текст, приведённый ниже. Если он соответствует Вашим ожиданиям, нажмите ОК для добавления оповещения. В противном случае повторите действие и попробуйте другое ключевое слово

# WizardStep5
source: It’s ready! Now specify the name of notification to be displayed in the main log
ru_ru: Готово! Осталось указать название оповещения для отображения в журнале

# WizardForm_WizardRadio
source: Using &wizard
ru_ru: С помощью м&астера

# WizardForm_ClipboardRadio
source: From clip&board
ru_ru: Из &буфера обмена

# WizardForm_TemplateRadio
source: From &template
ru_ru: Из &шаблона

# TemplateSelect
source: Create new notification:
ru_ru: Создание нового оповещения:

# UNNotSettingsForm_ComparatorFlag
source: Check the first number in text and show urgent notification if it is
ru_ru: Проверять первое число в тексте и показывать срочное уведомление, если оно

# UNNotSettingsForm_MisfitsFlag
source: Don’t show non-urgent
ru_ru: Не показывать несрочные

# UNGenSettingsForm_WindowCallFlag
source: Show main window on urgent notifications
ru_ru: Показывать главное окно при срочных уведомлениях

# Tip_1000
source: This function allows you to set a numerical threshold. It will be compared with the first number in every obtained text using the specified comparison method. If the new text matches the condition, app will display a special warning. It is also possible to display a notification only if this condition is met
ru_ru: Эта функция позволяет установить числовой порог. Он будет сравниваться с первым номером в каждом полученном тексте с использованием указанного метода сравнения. Если новый текст соответствует условию, приложение отобразит специальное предупреждение. Также возможно отображение уведомления только при соблюдении этого условия

# UNNotSettingsForm_CheckAvailability
source: Notify if the source is unavailable
ru_ru: Сообщать, если ресурс недоступен

# RecallAllNews
source: Re-request all notifications to check settings?
ru_ru: Опросить заново все оповещения для проверки настроек?

# ShareVariant
source: How do you want to share configured notifications? • Click “To file” to save all settings to the file; • Click “To clipboard” to send settings of the current notification to the clipboard
ru_ru: Как Вы хотите поделиться настроенными уведомлениями? • Нажмите «В файл», чтобы сохранить все настройки в файл; • Нажмите «В буфер», чтобы отправить настройки текущего уведомления в буфер обмена

# LoadingWarning
source: WARNING: this option will overwrite all existing settings. Continue?
ru_ru: ВНИМАНИЕ: эта опция перезапишет все существующие настройки. Продолжить?

# WizardForm_FileRadio
source: From &file
ru_ru: Из &файла

# ShareClipboard
source: To clip&board
ru_ru: В &буфер

# ShareFile
source: To &file
ru_ru: В &файл

# undfile
source: Settings exchange file for uNot service
ru_ru: Файл обмена настройками службы uNot

# ComparatorTypes
source: greater than greater than or equal to less than less than or equal to equal to not equal to contains doesn’t contain
ru_ru: больше, чем больше либо равно меньше, чем меньше либо равно равно не равно содержит не содержит

# NotAddedMessage
source: Notification has been added:
ru_ru: Добавлено оповещение:

# NotRemovedMessage
source: Notification has been removed
ru_ru: Оповещение удалено

# NotUpdatedMessage
source: Notification has been updated:
ru_ru: Обновлено оповещение:

# UNGenSettingsForm_UrgentSigLabel
source: Generate urgent notification for the following characters:
ru_ru: Срочное уведомление для следующих символов:

# FontLabel
source: Font:
ru_ru: Шрифт:

# DisableContextMenu
source: Disable notification
ru_ru: Отключить уведомление

# SetupContextMenu
source: Setup notification...
ru_ru: Настроить уведомление...

# DeleteContextMenu
source: Remove from log
ru_ru: Удалить из журнала

# TransculentContextMenu
source: Transculent log items
ru_ru: Полупрозрачные записи в журнале

# UNNotSettingsForm_EnabledCheck
source: Enabled
ru_ru: Включено

# UNGenSettingsForm_NotificationsSection
source: Notifications settings
ru_ru: Настройки уведомлений

# UNGenSettingsForm_GeneralSection
source: General settings
ru_ru: Общие настройки

# UNGenSettingsForm_LogColorLabel
source: Log color theme:
ru_ru: Цветовая тема журнала:

# UNGenSettingsForm_TranslucencyField
source: Translucent log items
ru_ru: Полупрозрачные элементы журнала

# UNGenSettingsForm_FontSizeLabel
source: Log font size:
ru_ru: Размер шрифта журнала:

# NotMenu_Setup
source: Setup...
ru_ru: Настроить...

# NotMenu_AddCopy
source: Copy to new item
ru_ru: Скопировать в новый элемент

# NotMenu_Share
source: Share
ru_ru: Поделиться

# NotMenu_AddWizard
source: Notifications wizard
ru_ru: Мастер оповещений

# ManualDelimitersForm_PageLabel
source: Markup of the target webpage:
ru_ru: Разметка целевой веб-страницы:

# WizardForm_ManualRadio
source: Manual markup selection
ru_ru: Ручной выбор разметки

# HtmlSearchRequest
source: Enter a word to search
ru_ru: Введите слово для поиска

# HtmlNotFound
source: Cannot find the specified word
ru_ru: Не удаётся найти указанное слово

# AutoscrollFlag
source: Autoscroll
ru_ru: Автопрокрутка
